# -*- coding: utf-8 -*-
"""
Created on Fri Oct  2 16:13:02 2026

@author: user
"""

# =============================================================================
# 練習題：宇宙珍奶點餐機
# 🧋 練習情境
# 你今天晚上去夜市開了一家「宇宙級珍奶店」。你需要寫一個簡單的點餐程式，幫來到地球的外星人顧客計算他們點了幾種飲料，並查出對應的價格與找零。
# 請在你的 Spyder 編輯器中複製以下基礎資料，並依序完成下方的任務：
# 
# # 1. 店裡的飲料菜單與價格 (Dict 字典)
# menu = {
#     "珍珠奶茶": 60,
#     "宇宙紅茶": 30,
#     "流星綠茶": 35
# }
# 
# # 2. 外星人點的飲料清單 (List 串列，他點了兩杯珍奶和一杯紅茶)
# orders = ["珍珠奶茶", "珍珠奶茶", "宇宙紅茶"]
# 請謹慎使用程式碼。

# =============================================================================
# =============================================================================
#【任務一】Set 任務（計算點了幾種飲料）
# 外星人雖然點了 3 杯飲料，但裡面有重複的項目。請將 orders 清單轉成 Set（集合）來自動去除重複。接著配合 len() 函式，印出：「顧客總共點了幾種不同的飲料？」。
#【任務二】Dict 任務（手動查詢價格）
# 請使用 print() 搭配字典查詢，幫外星人查出他點的第一杯飲料（也就是 orders[0] 珍珠奶茶）在菜單 menu 裡的價格是多少元？
#【任務三】互動任務（收錢與找零計算）
# 外星人點的這三杯飲料總金額是 150 元。請用 input() 詢問外星人："請輸入您支付的金額："。
# o	提示一：記得將輸入的文字轉型成數字，才能進行數學運算。
# o	提示二：計算並用 print() 印出要找給外星人多少錢。（公式：支付金額 - 150）
# =============================================================================
