# -*- coding: utf-8 -*-
"""
Created on Fri Oct  2 14:05:52 2026

@author: user
"""

# =============================================================================
# 練習題：末日便利商店的奸商系統
# 【情境說明】
# 殭屍末日爆發，你開了一間便利商店，物資非常稀缺，你需要用 Dict 來管理商品和價格。
# 初始物資與價格（硬幣）如下：
# shop = {"泡麵": 50, "罐頭": 80, "純淨水": 100}
# 【你的任務】
# 請用 Dict 的操作方法寫出一段系統：
# 殭屍潮即將來襲，純淨水變得極度珍貴！請將 純淨水 的價格調漲為 300。
# 你新進貨了稀有物資 「散彈槍子彈」，請在字典中新增這個品項，定價 500。
# 一位倖存者想買泡麵，請用關鍵字檢查 「泡麵」 是否還在店裡，如果在，印出：「泡麵還有貨！價格是 XX 硬幣」。
# 泡麵被買走了，請將 泡麵 從字典中刪除。
# =============================================================================

shop = {"泡麵": 50, "罐頭": 80, "純淨水": 100}

# 調漲純淨水價格為300
shop['純淨水'] = 300

# 新增品項 散彈槍子彈
shop['散彈槍子彈'] = 500

# 檢查泡麵是否存在
if '泡麵' in shop:
    print(f'泡麵還有貨！價格是{shop['泡麵']}硬幣')
    
# 將 泡麵 從字典中刪除
del shop['泡麵']
print(f'目前商店剩餘物資: {shop}')

