# -*- coding: utf-8 -*-
"""
Created on Fri Oct  2 11:33:17 2026

@author: user
"""

# =============================================================================
# 題目：黑巫師的魔法藥水調配器
# 題目說明：
# 你是魔法學院的藥水調酒師。今天你要幫同學調配一種「隱形藥水」，調配規則如下：
# 基底魔法水：每人低消一律先加固定的 150 毫升。
# 魔法粉末：同學可以自己決定要加入幾克粉末。每 1 克粉末會膨脹產生 2.5 毫升的藥水。
# 裝瓶打包：調配好總毫升數後，要裝進專用的「魔法大燒杯」裡，每瓶燒杯最多隻能裝 100 毫升。裝不滿一整瓶的剩餘藥水，就必須用「小試管」裝著。
# 請寫一個程式，詢問使用者的名字與粉末克數，幫他計算出：
# 總共調配出多少毫升藥水？
# 需要幾瓶「大燒杯」？\
# 最後剩下多少毫升要裝在「小試管」？
# 📥 輸入預期（Input）
# 請輸入巫師的名字：（例如輸入：哈利）
# 請輸入你想加入幾克魔法粉末：（例如輸入：35）
# 
# =============================================================================

name = input('請輸入巫師的名字：')
addPowder = input('請輸入你想加入幾克魔法粉末：')

# 藥水總量
total = 150 + float(addPowder) * 2.5

# 計算需要的燒瓶數量 (每瓶100ml)
flask = int(total // 100)

# 計算剩下裝在小試管的ml
smallTestTube = total % 100

print(f'🧙 嗨，{name}巫師！調配報告如下：')
print(f'調配出的藥水總量為：{total} 毫升。')
print(f'你需要準備：{flask} 瓶大燒杯。')
print(f'剩下不滿一瓶的{smallTestTube}毫升，請裝在小試管中。')
