# -*- coding: utf-8 -*-
"""
Created on Fri Oct  2 11:37:17 2026

@author: user
"""

# =============================================================================
# # 上課 - Print 用法

# name = input('請輸入您的名字 : ');
# age = input('請輸入您的年紀 : ');
# 
# print('歡迎今年', age, '歲的', name, spe='')
# print(f'歡迎今年{age}歲的{name}')
# 
# 
# =============================================================================

# =============================================================================
# # 上課練習 - 攝氏轉華氏
# 
# celsius_str = input('請輸入現在攝氏幾度? ');
# celsius = float(celsius_str)
# newCelsius = celsius * 1.8 + 32
# 
# print('換算成華氏溫度是：', newCelsius)
# 
# =============================================================================
