# -*- coding: utf-8 -*-
"""
Created on Fri Oct  2 13:28:39 2026

@author: user
"""

# =============================================================================
# 練習題：霍格華茲的魔藥課
# 【情境說明】
# 哈利波特在魔藥課上打瞌睡，不小心把大釜裡的調配順序搞砸了！
# 大釜裡目前的魔藥成分順序如下：
# pot = ["草蛉蟲", "雙角獸角粉末", "節肢動物的眼睛", "河童的鱗片"]
# 【你的任務】
# 請用 List 的操作方法幫哈利重整大釜，步驟如下：
# 石內卜教授走過來，命令哈利立刻把最後一項 河童的鱗片 拿掉（移除最後一個元素）。
# 在大釜的最前面，加上主原料 「催狂魔的眼淚」（在索引 0 的位置插入元素）。
# 檢查大釜，發現 雙角獸角粉末 不夠，請把它替換成 「獨角獸的毛」。
# 攪拌魔藥！請將整桶魔藥的順序反轉（Reverse）。
# 印出最後的大釜清單。
# 
# =============================================================================

pot = ["草蛉蟲", "雙角獸角粉末", "節肢動物的眼睛", "河童的鱗片"]

# 移除最後一個元素
pot.pop(3)
print(pot)

# 最前面插入催狂魔的眼淚
pot.insert(0, '催狂魔的眼淚')
print(pot)

# 雙角獸角粉末替換獨角獸的毛
pot[2] = "獨角獸的毛"
print(pot)

# 反轉
pot.reverse()


print('最後的大釜清單:', pot)