# -*- coding: utf-8 -*-
"""
Created on Fri Oct  2 11:37:17 2026

@author: user
"""

# =============================================================================
# # 上課 - Print 用法

# name = input('請輸入您的名字 : ');
# age = input('請輸入您的年紀 : ');
# 
# print('歡迎今年', age, '歲的', name, spe='')
# print(f'歡迎今年{age}歲的{name}')
# 
# 
# =============================================================================

# =============================================================================
# # 上課練習 - 攝氏轉華氏
# 
# celsius_str = input('請輸入現在攝氏幾度? ');
# celsius = float(celsius_str)
# newCelsius = celsius * 1.8 + 32
# 
# print('換算成華氏溫度是：', newCelsius)
# 
# =============================================================================

# =============================================================================
# # 上課 - 字典 (dictionary)
# vocab = {"apple": "蘋果", "banana": "香蕉", "cat": "貓咪"}
# word = input("請輸入你要查的英文單字：")
# meaning = vocab.get(word, "抱歉，我的字典裡沒有這個字...")
# 
# print("中文意思是：", meaning)
# =============================================================================
