# -*- coding: utf-8 -*-
"""
Created on Fri Oct 16 10:49:34 2026

@author: user
"""

# =============================================================================
# 課堂即時練習 2-2-1 單向選擇 (Simple if)
# 【題目】入職體檢警示系統
# 【任務描述】
# 公司年度健檢系統需要自動篩選血壓異常員工。
# 請撰寫程式讓用戶輸入「收縮壓」數值（整數）。
# 若數值大於 140，印出「提醒：您的收縮壓偏高，請列入自主健康管理並諮詢醫師」。
# =============================================================================

systolic_pressure = int(input("請輸入收縮壓: "))

if systolic_pressure > 140:
    print('提醒：您的收縮壓偏高，請列入自主健康管理並諮詢醫師')
    