# -*- coding: utf-8 -*-
"""
Created on Fri Oct 16 11:13:55 2026

@author: user
"""

# =============================================================================
# 課堂即時練習 2-2-3  多向選擇 (if-elif-else)
# 【題目】商品折扣等級計算 
# 【任務描述】
# 請撰寫程式輸入商品單價。
# 單價 5000 以上打 8 折；3000 以上打 9 折；其餘不打折。最後印出「折扣後單價」。
# =============================================================================

product_price = int(input("請輸入輸入商品單價: "))

if product_price > 5000:
    print(f'折扣後單價 {product_price*0.8}')
elif product_price > 3000:
    print(f'折扣後單價 {product_price*0.9}')
else:
    print(f'折扣後單價 {product_price}')