# -*- coding: utf-8 -*-
"""
Created on Fri Oct 16 13:08:35 2026

@author: user
"""

# =============================================================================
# 課堂即時練習 2-3-1   for 迴圈與 range() 函式
# 【題目】整數數列產生器 
# 【任務描述】
# 利用 for 迴圈與 range() 產生從 10 到 100 之間（包含 100），所有 10 的倍數
# =============================================================================

# 已知倍數可以用累加的時候 range(10, 101, 10)
for num in range(10, 101, 10):
    print(num)
    
print("-----------------------------------")

# 另一種方式，用mode的方式計算餘數為0
for num in range(10, 101):
    if num % 10 == 0:
        print(num)



# =============================================================================
# #【實務案例：自動化薪資單批次加密】
# staff_list = ["Alice", "Bob", "Charlie", "David", "Eve"]
# print(">>> 啟動薪資發放自動化程序 <<<")
# 
# # 使用 enumerate 同時取得索引(序號)與內容(姓名)
# for index, name in enumerate(staff_list, start=1):
#     print("---------------------------------")
# 
#     # index:03 代表數字佔三位且補零（如 001）
#     print(f"【步驟 1】讀取員工 ID: {index:03} 資料中...")
#     print(f"【步驟 2】準備對 {name} 進行數據加密...")
#     print(f"【步驟 3】模擬郵件已寄送至 {name.lower()}@corp.com")
# =============================================================================
