# -*- coding: utf-8 -*-
"""
Created on Fri Oct 16 10:49:34 2026

@author: user
"""

# =============================================================================
# 課堂即時練習 2-2-1 單向選擇 (Simple if)
# 【題目】入職體檢警示系統
# 【任務描述】
# 公司年度健檢系統需要自動篩選血壓異常員工。
# 請撰寫程式讓用戶輸入「收縮壓」數值（整數）。
# 若數值大於 140，印出「提醒：您的收縮壓偏高，請列入自主健康管理並諮詢醫師」。
# =============================================================================

systolic_pressure = int(input("請輸入收縮壓: "))

if systolic_pressure > 140:
    print('提醒：您的收縮壓偏高，請列入自主健康管理並諮詢醫師')


# =============================================================================
# # 【職場實務：智慧化電商折扣系統】
# # 初始環境設定
# shipping_fee = 100 # 預設基礎運費
# total_amount = int(input("請輸入訂單總金額："))
# membership_level = "VVIP" # 模擬從資料庫讀取的會員等級
# 
# # 單向攔截：當條件滿足時，執行「特定優化」
# # 使用 or 運算子實現多重條件觸發
# if total_amount >= 2000 or membership_level == "VVIP":
#     shipping_fee = 0
#     print("【系統訊息】系統識別：符合滿額或尊榮會員資格。")
#     print("【狀態變更】已成功套用『免運費專案』。")
#     
# # 輸出最終計算結果
# print("\n===== 結帳明細 =====")
# print(f"商品原始金額：{total_amount} 元")
# print(f"應付運費支出：{shipping_fee} 元")
# print(f"應付總額 (含運)：{total_amount + shipping_fee} 元")
# =============================================================================

